Repository: dounasth/woocommerce-alphabank-payment-gateway
Catalog: languages/woocommerce-nbg-payment-gateway-*.po
Languages: el

source: National Bank Greece Payment Gateway allows you to accept payment through various channels such as Maestro, Mastercard and Visa cards On your Woocommerce Powered Site.
el: Η πύλη πληρωμής μέσω Εθνικής Τράπεζας σας επιτρέπει να λαμβάνεται πληρωμές μέσω καρτών Maestro, Mastercard και Visa στο Woocommerce κατάστημα σας,

source: National Bank Greece Gateway
el: Εθνική Τράπεζας της Ελλάδας

source: National Bank Greece Gateway allows you to accept payment through various channels such as Maestro, Mastercard and Visa cards.
el: Η πύλη πληρωμής μέσω Εθνικής Τράπεζας σας επιτρέπει να λαμβάνεται πληρωμές μέσω καρτών Maestro, Mastercard και Visa.

source: Enable/Disable
el: Ενεργοποίηση/Απενεργοποίηση

source: Enable National Bank Greece Gateway
el: Ενεργοποίηση πύλης πληρωμής Εθνικής Τράπεζας

source: Enable or disable the gateway.
el: Ενεργοποίηση ή απενεργοποίηση της πύλης πληρωμής.

source: Title
el: Τίτλος

source: This controls the title which the user sees during checkout.
el: Ελέγχει το τίτλο που εμφανίζεται στο ταμείο.

source: National Bank of Greece Gateway
el: Πύλη πληρωμής Εθνικής Τράπεζας

source: Description
el: Περιγραφή

source: This controls the description which the user sees during checkout.
el: Ελέγχει τη περιγραφή που βλέπει ο χρήστης στο ταμείο.

source: Pay Via National Bank Greece: Accepts Mastercard, Visa cards and etc.
el: Πληρωμή μέσω Εθνικής Τράπεζας: Γίνονται δεκτές Mastercard, Visa κλπ.

source: NBG Username
el: Username Εθνικής

source: Enter your NBG Username
el: Εισάγεται το Username της Εθνικής Τράπεζας

source: NBG Password
el: Password Εθνικής

source: Enter your NBG Password
el: Εισάγεται το Password της Εθνικής Τράπεζας

source: Pre-Authorize
el: Προ-Έγκριση

source: Default payment method is Authorize, enable for Pre-Authorized payments.
el: Προεπιλεγμένη μέθοδος είναι η έγκριση, ενεργοποιήστε για προεγκεκριμένες πληρωμές. Θα πρέπει στη συνέχεια να τις αποδέχεστε από το σύστημα της Τράπεζας

source: Select between Authorize and Pre-Authorize
el: Επιλογή Έγκρισης ή Προ-Έγκρισης συναλλαγής

source: NBG Transaction Description
el: Περιγραφή Συναλλαγής προς Εθνική

source: Add a description to the transactions
el: Προσθέτει μια περιγραφή στη συναλλαγή

source: Enable Test Mode
el: Ενεργοποίηση Test Mode

source: This controls the payment mode as TEST or LIVE.
el: Ελέγχει αν η πληρωμή βρίσκεται σε TEST ή LIVE περιβάλλον

source: Return Page
el: Σελίδα επιστροφής

source: URL of success page
el: URL της σελίδας επιτυχίας

source: Max Installments
el: Μέγιστες δόσεις

source: 1 to 24 Installments,1 for one time payment
el: 1 μέχρι 24 άτοκες δόσεις, 1 για εφάπαξ πληρωμή

source: Thank you page
el: Σελίδα Ευχαριστούμε

source: Could not connect to NBG server, please contact the administrator
el: Δε μπόρεσε να πραγματοποιηθεί σύνδεση με το εξυπηρέτη της Εθνικής Τράπεζας, παρακαλώ επικοινωνήστε με το διαχειριστή.

source: An error occurred, please contact the administrator
el: Πραγματοποιήθηκε σφάλμα, παρακαλώ επικοινωνήστε με το διαχειριστή.

source: Thank you for your order. We are now redirecting you to National Bank Greece to make payment.
el: Ευχαριστούμε για τη παραγγελία. Μεταφέρεστε τώρα στη Εθνική Τράπεζα για να πραγματοποιήσετε τη πληρωμή.

source: Pay via NBG
el: Πληρωμή μέσω Εθνικής Τράπεζας

source: Cancel order &amp; restore cart
el: Ακύρωση παραγγελίας &amp; επαναφορά καλαθιού

source: Thank you - your order is now pending payment. You should be automatically redirected to National Bank of Greece to make payment.
el: Ευχαριστούμε - η παραγγελία σας

source: Payment Via NBG<br />Transaction ID:
el: Πληρωμή μέσω Εθνικής Τράπεζς <br/> Transaction ID:

source: Payment Received.<br />Your order is currently being processed.<br />We will be shipping your order to you soon.<br />NBG Transaction ID:
el: Λάβαμε πληρωμή.<br />Η παραγγελία σας βρίσκεται υπό επεξεργασία.<br />Θα σας αποστείλουμε την παραγγελία σας το συντομότερο.<br />NBG Transaction ID:

source: Thank you for shopping with us.<br />Your transaction was successful, payment was received.<br />Your order is currently being processed.
el: Ευχαριστούμε που μας επιλέξατε.<br /> Η συναλλαγή σας ήταν επιτυχής, η πληρωμή έχει ληφθεί.<br /> Η παραγγελία σας βρίσκεται υπό επεξεργασία.

source: Payment received, your order is now complete.
el: Λάβαμε την πληρωμή, η παραγγελία σας έχει ολοκληρωθεί.

source: Payment Via NBG Payment Gateway<br />Transaction ID:
el: Πληρωμή μέσω Εθνικής Τράπεζς <br/> Transaction ID:

source: Payment Received.<br />Your order is now complete.<br />NBG Transaction ID:
el: Λάβαμε την πληρωμή.<br/>Η παραγγελία σας έχει ολοκληρωθεί.<br/>NBG Transaction ID:

source: Thank you for shopping with us.<br />Your transaction was successful, payment was received.<br />Your order is now complete.
el: Ευχαριστούμε που μας επιλέξατε.<br />Η συναλλαγή σας ήταν επιτυχής, η πληρωμή έχει ληφθεί.<br />Η παραγγελία σας έχει ολοκληρωθεί.

source: Payment received, your order is currently being processed.
el: Λάβαμε τη πληρωμή, η παραγγελία σας βρίσκεται υπό επεξεργασία

source: Thank you for shopping with us. <br />However, the transaction wasn't successful, payment wasn't received.
el: Ευχαριστούμε που μας επιλέξατε.<br/>Δυστυχώς η συναλλαγή δεν ήταν επιτυχής, δε λάβαμε την πληρωμή.

source: Thank you for shopping with us. <br />However, an error occurred and the transaction wasn't successful, payment wasn't received.
el: Ευχαριστούμε που μας επιλέξατε.<br/>Δυστυχώς παρουσιάστηκα σφάλμα και η συναλλαγή δεν ήταν επιτυχής, δε λάβαμε πληρωμή.
